Emacs.org
** Color Theme

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp

(use-package doom-themes
  :init (load-theme 'doom-one-light t))

#+end_src

Something nice that comes along with [[https://github.com/d12frosted/homebrew-emacs-plus][Emacs+]] is the ability to hook into the system appearance change. I.E. we can have automatic dark/light mode switching.

#+begin_src emacs-lisp

(defun luda/apply-theme (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (load-theme 'doom-one-light t))
    ('dark (load-theme 'doom-one t))))

(add-hook 'ns-system-appearance-change-functions #'luda/apply-theme)

#+end_src

Smoother theme switching too. Answer grabbed from this [[https://emacs.stackexchange.com/questions/24088/make-a-function-to-toggle-themes][Stack Exchange]] answer

#+begin_src emacs-lisp

(setq luda/themes '(doom-one-light doom-one))
(setq luda/themes-index 0)

(defun luda/cycle-theme ()
  (interactive)
  (setq luda/themes-index (% (1+ luda/themes-index) (length luda/themes)))
  (luda/load-indexed-theme))

(defun luda/load-indexed-theme ()
  (luda/try-load-theme (nth luda/themes-index luda/themes)))

(defun luda/try-load-theme (theme)
  (if (ignore-errors (load-theme theme :no-confirm))
      (mapcar #'disable-theme (remove theme custom-enabled-themes))
    (message "Unable to find theme file for ‘%s’" theme)))
    
(global-set-key [f5] 'luda/cycle-theme)

#+end_src

Trying to build up my Liminal Vim theme for emacs

#+begin_example emacs-lisp

(add-to-list 'load-path "~/code/liminal")
(load "liminal-theme")

#+end_example

** Better Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run `M-x all-the-icons-install-fonts` so that mode line icons display correctly.

#+begin_src emacs-lisp

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom 
  ((doom-modeline-buffer-encoding nil)
  (set-face-attribute 'mode-line nil :family "Fira Code" :height 130)
  (set-face-attribute 'mode-line-inactive nil :family "Fira Code" :height 130)))

#+end_src

** Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))

#+end_src

** Ivy and Counsel

[[https://oremacs.com/swiper/][Ivy]] is an excellent completion framework for Emacs.  It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs.  Counsel is a customized set of commands to replace `find-file` with `counsel-find-file`, etc which provide useful commands for each of the default completion commands.

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.

#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :custom
    (ivy-use-virtual-buffers t)
    (ivy-count-format "%d/%d ")
    (ivy-height 15)
    ;; fuzzy everywhere except when searching for something
    (ivy-re-builders-alist
        '((swiper . ivy--regex-plus)
        (counsel-rg . ivy--regex-plus)
        (counsel-grep-or-swiper . ivy--regex-plus)
        (t . ivy--regex-fuzzy)))
    (ivy-virtual-abbreviate 'full)
    (ivy-do-completion-in-region nil)
    (ivy-wrap t)
    (ivy-fixed-height-minibuffer t)
    (projectile-completion-system 'ivy)
    (ivy-initial-inputs-alist nil) ;; Don't use ^ as initial input
    (ivy-format-function #'ivy-format-function-line) ;; highlight til EOL
    (ivy-magic-slash-non-match-action nil) ;; disable magic slash on non-match
    (ivy-extra-directories nil) ;; . and .. are more trouble than worth
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (("C-M-j" . 'counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))

#+end_src

*** Improved Candidate Sorting with prescient.el

prescient.el provides some helpful behavior for sorting Ivy completion candidates based on how recently or frequently you select them.  This can be especially helpful when using =M-x= to run commands that you don't have bound to a key but still need to access occasionally.

This Prescient configuration is optimized for use in System Crafters videos and streams, check out the [[https://youtu.be/T9kygXveEz0][video on prescient.el]] for more details on how to configure it!

#+begin_src emacs-lisp

  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    ;(prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src

** Helpful Help Commands

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp

  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Text Scaling

This is an example of using [[https://github.com/abo-abo/hydra][Hydra]] to design a transient key binding for quickly adjusting the scale of the text on screen.  We define a hydra that is bound to =C-s t s= and, once activated, =j= and =k= increase and decrease the text scale.  You can press any other key (or =f= specifically) to exit the transient key map.

#+begin_src emacs-lisp

  (use-package hydra
    :defer t)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (luda/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

** Colored Identifiers

#+begin_src emacs-lisp

  (use-package color-identifiers-mode
      :ensure t
      :init
        (add-hook 'js2-mode-hook 'color-identifiers-mode))
  
  (add-hook 'after-init-hook 'global-color-identifiers-mode)

#+end_src

** Focused Editing

#+begin_src emacs-lisp

;; Distraction free mode
(use-package olivetti)
(use-package focus)

;; Simplified/Altered version of https://www.reddit.com/r/emacs/comments/33gsh6/trouble_with_writeroom_mode/
(defun luda/enter-focused-mode ()
  "Toggle a distraction-free environment for coding."
  (interactive)
  (cond ((bound-and-true-p olivetti-mode)
         (olivetti-mode -1)
         (focus-mode -1))
        (t
         (setq olivetti-body-width (floor (* (frame-width) 0.66)))
         (olivetti-mode 1)
         (focus-mode 1)
         (display-line-numbers-mode -1))))

#+end_src

* UX Configuration

For a more predicable, less error prone, more vim like undo experience. This is done with [[https://github.com/apchamberlain/undo-tree.el][Undo Tree]]. I rarely need the visualization aspect but this plugin pretty cleanly maps to Vim undo tree model. 99% of the time I just want it for the undo/redo to act like Vim's.

#+begin_src emacs-lisp

(use-package undo-tree
  :config
  (global-undo-tree-mode 1)
  (define-key evil-normal-state-map "u" 'undo-tree-undo)
  (define-key evil-normal-state-map "U" 'undo-tree-redo)
  (define-key evil-normal-state-map "\C-r" 'undo-tree-redo))

#+end_src

Use [[https://github.com/DarwinAwardWinner/amx][AMX]] in place of =execute-extended-command=

#+begin_src emacs-lisp

(use-package amx
  :ensure t
  :bind ([remap execute-extended-command] . amx)
  :config
  (setq-default amx-save-file
                (concat user-emacs-directory ".cache/amx-items")))

#+end_src

Add [[https://github.com/bbatsov/crux][Crux]] for random useful utility functions. Not 100% it's worth adding but :shrug:

#+begin_src emacs-lisp

  (use-package crux)

  (luda/leader-keys 'normal
    "O" 'crux-smart-open-line-above
    "o" 'crux-smart-open-line)
    
  (general-def '(normal)
    "H" 'crux-move-beginning-of-line
    "L" 'end-of-line)

#+end_src

[[https://github.com/magnars/expand-region.el][Expand Region]] for semantically aware selection is useful anyway but especially so when paired with vim's visual mode.

#+begin_src emacs-lisp

    (use-package expand-region)

    (general-def 'visual
    "v" 'er/expand-region
    "V" 'er/contract-region)

#+end_src

