init.el

(use-package doom-themes
  :init (load-theme 'doom-one-light t))

(defun luda/apply-theme (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (load-theme 'doom-one-light t))
    ('dark (load-theme 'doom-one t))))

(add-hook 'ns-system-appearance-change-functions #'luda/apply-theme)

(setq luda/themes '(doom-one-light doom-one))
(setq luda/themes-index 0)

(defun luda/cycle-theme ()
  (interactive)
  (setq luda/themes-index (% (1+ luda/themes-index) (length luda/themes)))
  (luda/load-indexed-theme))

(defun luda/load-indexed-theme ()
  (luda/try-load-theme (nth luda/themes-index luda/themes)))

(defun luda/try-load-theme (theme)
  (if (ignore-errors (load-theme theme :no-confirm))
      (mapcar #'disable-theme (remove theme custom-enabled-themes))
    (message "Unable to find theme file for ‘%s’" theme)))
    
(global-set-key [f5] 'luda/cycle-theme)

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom 
  ((doom-modeline-buffer-encoding nil)
  (set-face-attribute 'mode-line nil :family "Fira Code" :height 130)
  (set-face-attribute 'mode-line-inactive nil :family "Fira Code" :height 130)))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :custom
  (ivy-use-virtual-buffers t)
  (ivy-count-format "%d/%d ")
  (ivy-height 15)
  ;; fuzzy everywhere except when searching for something
  (ivy-re-builders-alist
      '((swiper . ivy--regex-plus)
      (counsel-rg . ivy--regex-plus)
      (counsel-grep-or-swiper . ivy--regex-plus)
      (t . ivy--regex-fuzzy)))
  (ivy-virtual-abbreviate 'full)
  (ivy-do-completion-in-region nil)
  (ivy-wrap t)
  (ivy-fixed-height-minibuffer t)
  (projectile-completion-system 'ivy)
  (ivy-initial-inputs-alist nil) ;; Don't use ^ as initial input
  (ivy-format-function #'ivy-format-function-line) ;; highlight til EOL
  (ivy-magic-slash-non-match-action nil) ;; disable magic slash on non-match
  (ivy-extra-directories nil) ;; . and .. are more trouble than worth
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("C-M-j" . 'counsel-switch-buffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :config
  (counsel-mode 1))

(use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  ;; Uncomment the following line to have sorting remembered across sessions!
  ;(prescient-persist-mode 1)
  (ivy-prescient-mode 1))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package hydra
  :defer t)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(luda/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(use-package color-identifiers-mode
    :ensure t
    :init
      (add-hook 'js2-mode-hook 'color-identifiers-mode))

(add-hook 'after-init-hook 'global-color-identifiers-mode)

;; Distraction free mode
(use-package olivetti)
(use-package focus)

;; Simplified/Altered version of https://www.reddit.com/r/emacs/comments/33gsh6/trouble_with_writeroom_mode/
(defun luda/enter-focused-mode ()
  "Toggle a distraction-free environment for coding."
  (interactive)
  (cond ((bound-and-true-p olivetti-mode)
         (olivetti-mode -1)
         (focus-mode -1))
        (t
         (setq olivetti-body-width (floor (* (frame-width) 0.66)))
         (olivetti-mode 1)
         (focus-mode 1)
         (display-line-numbers-mode -1))))

(use-package undo-tree
  :config
  (global-undo-tree-mode 1)
  (define-key evil-normal-state-map "u" 'undo-tree-undo)
  (define-key evil-normal-state-map "U" 'undo-tree-redo)
  (define-key evil-normal-state-map "\C-r" 'undo-tree-redo))

(use-package amx
  :ensure t
  :bind ([remap execute-extended-command] . amx)
  :config
  (setq-default amx-save-file
                (concat user-emacs-directory ".cache/amx-items")))

(use-package crux)

(luda/leader-keys 'normal
  "O" 'crux-smart-open-line-above
  "o" 'crux-smart-open-line)

(general-def '(normal)
  "H" 'crux-move-beginning-of-line
  "L" 'end-of-line)

(use-package expand-region)

(general-def 'visual
"v" 'er/expand-region
"V" 'er/contract-region)
